//I made this file to use as a renference for what the api returns, no intention to use or commit.

{
  "data": {
    "columns": [
      {
        "colType": "Text",
        "numRows": 94465,
        "numUniqueValues": 5,
        "sample": [
          "Southwest Airlines",
          "American Airlines",
          "airline_name",
          "United Airlines",
          "Delta Air Lines"
        ],
        "sampleHeader": "airline_name"
      },
      {
        "colType": "Date",
        "numRows": 94465,
        "numUniqueValues": 101,
        "sample": [
          "9/05/17",
          "date",
          "4/09/17",
          "1/05/16",
          "3/08/16",
          "29/08/17",
          "4/03/17",
          "16/06/18",
          "25/10/16",
          "31/05/16"
        ],
        "sampleHeader": "date"
      },
      {
        "colType": "Number",
        "numRows": 94465,
        "numUniqueValues": 6,
        "sample": ["2", "4", "score", "1", "3", "5"],
        "sampleHeader": "score"
      },
      {
        "colType": "Text",
        "numRows": 94465,
        "numUniqueValues": 101,
        "sample": [
          "Delayed due to weather in other cities",
          "The Sliver Bird fly from Birmingham",
          "First Flight a Joy",
          "First flight with American Airlines",
          "Met President of Liberia (My Role Model): She Was a Doll...",
          "disappointing experience.",
          "If you cannot do it properly don't do it",
          "America Airlines treats people like cattle. ",
          "Attentive cabin crew",
          "Hit and miss"
        ],
        "sampleHeader": "title"
      },
      {
        "colType": "Text",
        "numRows": 94465,
        "numUniqueValues": 101,
        "sample": [
          "",
          "Tucson, United States",
          "Adamsville, Alabama",
          "Mobile, AL",
          "Sylacauga, Alabama",
          "Fishkill, New York",
          "Banbury, United Kingdom",
          "Birmingham, Alabama",
          "Fort Worth, Texas, United States",
          "Coventry, United Kingdom"
        ],
        "sampleHeader": "location"
      },
      {
        "colType": "Text",
        "numRows": 94465,
        "numUniqueValues": 101,
        "sample": [
          "I am not a seasoned flyer and the last time I travelled to the USA I travelled with Virgin over 25yrs ago, this time the whole holiday was booked with Thomas cook and the flights were with American Airlines who quite frankly were very disappointing. The staff and crew were very good but my complaint was with the food, it was terrible with a choice of two things only (not pre booked). This happened on both the outward flight and return.I also travelled on two internal flights in America where no food is served just a bag of nuts and free water. For fights of 51/2 hrs pretty disgusting considering the price we pay.Shall never use them again.",
          "Weather in Dallas caused our departure from MOB to be delayed. We were assured that our flight from DFW to RNO would also be late departing and therefore making the connection should not be a problem. Our connecting flight took off as we landed. We were placed on standby for another flight that was still 9 hours away; thanks to an American agent at DFW (Arlene, near gate B31?) we were able to move off of standby early enough not to be put in a quandary as to which gate to go to (we were tentatively booked on another flight that was an indrect route to RNO). LONG, boring day at DFW.When there is a known widespread weather delay at the receiving airport that is the basis for late departure from the sending airport, why is consideration not given to extending boarding time at least half of the departure delay time?",
          "I travelled with American Airlines for the first time from Birmingham, U.K. To JFK, New York and then from JFK to Orlando. It was also the last time I will be travelling with them. First off, the flight was delayed, now I'm aware delays happen so it's not the end of the world, but it would help if they at least give you an idea of how long, only because my friends and I had a connecting flight to catch at JFK. So eventually we boarded, and to my utter amazement when walking onboard, I found we'd been transported back to the early 1990's! Now all the transatlantic flights in economy I've taken in recent years have all been reasonably comfortable and all have had seat back screens so you can pick and choose what you'd like to watch from a fairly up to date selection of films and TV shows. Not on American Airlines, oh no. We had the awful middle of the aisle screens in which you get to sit uncomfortably at an angle in which to see the screen (don't even get me started on the comfort of the seats, put it this way, you'll like these seats if you like getting pins and needles constantly down one side). When you're finally in a position to watch the provided entertainment, prepare yourself for more disappointment! The film (I can't even remember it's title it was that bad) was from approximately 10 years ago. I was hoping it would improve after that, but no, airing next would be some of NBC's highlights apparently. Highlights they were not, if you enjoy watching some random bloke teaching some random woman to golf then you're in for a treat! So I gave up on the entertainment. Maybe a sleep would help, well it may have if it was at all possible to get comfortable in the seats. At this point it was time for food. This wasn't awful, it wasn't great, but it wasn't awful either. The drinks had a good selection as well. The onboard staff were a little rude at times as well and I'd never met any airline staff as obsessed with rubbish as American Airlines employees, I'd just poured my drink from my can when they can round to collect the rubbish and when i said I hadn't finished yet, you'd have thought I'd told the the lady that I'd just ran over her cat with the look I got. After all this I was just hoping to get to my final destination as quickly as possible. Unfortunately, this wasn't going to happen today! When we'd arrived at JFK they rushed us through to customs quickly as we had connecting flights which was very helpful, however, there had been no need to rush us through because we still had to wait for our luggage to come off which we had to collect and get it checked in to our next flight. We waited an hour for our luggage, an hour!!! Obviously at this point I wasn't best pleased, and took my luggage to head through to the connecting flight, to be told it had already left. I asked how it had left when I still had 30 mins, the response I received was \"it just had\". So onward I went to be told I would have to wait for the next flight which would be another 3 hours which wasn't too bad, but add that to my day made me just a little bit more angrier than usual. The domestic flight from JFK to Orlando was perfectly fine. The flight was on time, in fact they made the flight time an hour quicker which was very well received by all onboard ( a lot of them were from my original flight who had also missed the connection). The staff also seemed happier and brighter. So after all this my recommendations are this, if you're going to fly American Airlines, fly domestic. If you're going transatlantic, fly first class (you get treated like royalty in there) or don't fly at all!",
          "review",
          "Delays on every leg of the flight going both ways, careless gate agents as well as phone, will NEVER fly with American Airlines again.",
          "Worst experience we have ever had in twenty years of flying. The flight had a delayed departure in Birmingham ( 2 hours and 55 minutes) resulting in a missed connection in JFK. No explanation given.The plane was in pretty bad shape and we had to move because the tray tables were falling off. Arrived in JFK 2 hours and 16 mins late. We were met by an AA official as we were leaving the plane to say we could not board our connecting flight. He gave us vouchers to get on a bus to Newark airport ( the other side of New York) saying we were now booked on a United Airlines plane to Orlando leaving at 7pm. We were now on our own. To cut a long story short it was Columbus Day - the traffic was terrible, we were made to change buses to get to Newark. The second bus company would not accept the vouchers and charged us $34. We arrived at Newark at 18.40 pm. However on checking the boards our flight UA1417 had been delayed. We were then asked for $50 to check our bags in! No AA officials around to enquire about this flight or our extra charges. At the departure lounge we noticed the departure time for our flight was constantly changing. We went to speak to a UA official who was very rude and told us we had no guarantee of getting on the plane anyway. He then went off duty and closed the help desk. At 12.30 am after 6 hours in the airport another UA official arrived and gave us vouchers for $7 each - just enough for a bottle of water and a banana! Finally the plane arrived at 02.40 am. We were rushed on board - the plane took off about 5 mins before they were due to close the airport. No food or drink was offered during the flight and we arrived in Orlando at 6am - a delay of 12 hours.On contacting AA on return to UK they said they couldn't help us as no compensation was due and it was just too bad about the extra charges we had incurred. The whole experience was a nightmare. My wife and I are not young people and found the lack of assistance, being abandoned in a strange airport and having to suffer a wait of 9 hours with no help extremely stressful. AA's concern for welfare was nil backed up by their response when we got home. So, if you choose this airline be warned - if things go wrong then they are very unlikely to help you out. Best avoided.",
          "The flight crew were very nice and the flight was smooth and we could not have asked for anything to have been better.",
          "After flying on Southwest for many years, somehow I ended up on AA for a short business trip. The planes are falling apart, the seat back pockets are so worn there were holes in them. The plane just seemed rickety. On my return, the seat was so uncomfortable that it felt like iwas sitting on bricks. I will avoid AA at all costs.",
          "We paid extra just to PICK the seats that we wanted. Our flights were changed (I understand that this happens) and we didn't receive the seats we PAID EXTRA for. Some months later we are still waiting.......",
          "I was a little disappointed with this flight, the inflight entertainment was very poor, done on the very old style drop down screen along the middle of the cabin, not what I was expecting from such a major airline, in fact, the plane was old and I have had better flight on the cheap airlines on far newer planes.Food was fine, for in flight food.The flight attendants were not what I expected either, in fact quite grumpy is the best word I can find.Flight back was much the same, although the staff were much better."
        ],
        "sampleHeader": "review"
      },
      {
        "colType": "Text",
        "numRows": 94465,
        "numUniqueValues": 15,
        "sample": [
          "",
          "USA",
          "Asia",
          "Caribbean",
          "South Pacific",
          "North Asia",
          "International",
          "Russia",
          "Mexico",
          "Canada"
        ],
        "sampleHeader": "flight_type"
      },
      {
        "colType": "Text",
        "numRows": 94465,
        "numUniqueValues": 43,
        "sample": [
          "",
          "Dallas - Cincinnati",
          "Sao Paulo - Tokyo",
          "Grand Junction - Los Cabos",
          "New York City - Tel Aviv",
          "flight_class",
          "Boston - Orlando",
          "Grand Cayman - Miami",
          "Panama City - Toronto",
          "Honolulu - Washington DC"
        ],
        "sampleHeader": "flight_class"
      },
      {
        "colType": "Text",
        "numRows": 94465,
        "numUniqueValues": 101,
        "sample": [
          "Birmingham - Orlando",
          "Birmingham - Phoenix",
          "Mobile - Washington DC",
          "Huntsville - San Francisco",
          "Birmingham - Liberia",
          "Birmingham - Dayton",
          "Birmingham - Chicago",
          "Birmingham - Columbia",
          "Birmingham - Saint Louis",
          "Mobile - White Plains"
        ],
        "sampleHeader": "flight"
      },
      {
        "colType": "Number",
        "numRows": 94465,
        "numUniqueValues": 7,
        "sample": ["", "2", "4", "1", "seat_comfort", "3", "5"],
        "sampleHeader": "seat_comfort"
      },
      {
        "colType": "Number",
        "numRows": 94465,
        "numUniqueValues": 7,
        "sample": ["", "2", "4", "customer_service", "1", "3", "5"],
        "sampleHeader": "customer_service"
      },
      {
        "colType": "Number",
        "numRows": 94465,
        "numUniqueValues": 7,
        "sample": ["", "2", "4", "1", "3", "5", "cleanliness"],
        "sampleHeader": "cleanliness"
      },
      {
        "colType": "Number",
        "numRows": 94465,
        "numUniqueValues": 7,
        "sample": ["", "2", "4", "1", "3", "5", "food_beverages"],
        "sampleHeader": "food_beverages"
      },
      {
        "colType": "Number",
        "numRows": 94465,
        "numUniqueValues": 7,
        "sample": ["", "2", "4", "1", "3", "5", "legroom"],
        "sampleHeader": "legroom"
      },
      {
        "colType": "Number",
        "numRows": 94465,
        "numUniqueValues": 7,
        "sample": ["", "2", "4", "check_in", "1", "3", "5"],
        "sampleHeader": "check_in"
      },
      {
        "colType": "Number",
        "numRows": 94465,
        "numUniqueValues": 7,
        "sample": ["", "2", "4", "entertainment", "1", "3", "5"],
        "sampleHeader": "entertainment"
      },
      {
        "colType": "Number",
        "numRows": 94465,
        "numUniqueValues": 12,
        "sample": ["2", "4", "8", "6", "3", "1", "7", "9", "nps", "10"],
        "sampleHeader": "nps"
      },
      {
        "colType": "Number",
        "numRows": 94465,
        "numUniqueValues": 12,
        "sample": ["2", "csat", "4", "8", "1", "6", "3", "7", "9", "5"],
        "sampleHeader": "csat"
      },
      {
        "colType": "Number",
        "numRows": 94465,
        "numUniqueValues": 2,
        "sample": ["nps_duplicate", "0"],
        "sampleHeader": "nps_duplicate"
      },
      {
        "colType": "Date",
        "numRows": 94465,
        "numUniqueValues": 101,
        "sample": [
          "91",
          "68",
          "53",
          "1200",
          "87",
          "95",
          "1718",
          "1853",
          "52",
          "61"
        ],
        "sampleHeader": "ticket_price"
      },
      {
        "colType": "Text",
        "numRows": 94465,
        "numUniqueValues": 4,
        "sample": [
          "What can we improve?",
          "Other comments",
          "What went well?",
          "question"
        ],
        "sampleHeader": "question"
      },
      {
        "colType": "Number",
        "numRows": 94465,
        "numUniqueValues": 3,
        "sample": ["1", "0", "sensitive"],
        "sampleHeader": "sensitive"
      },
      {
        "colType": "Text",
        "numRows": 94465,
        "numUniqueValues": 101,
        "sample": [
          "hndb983xz5",
          "mzd7jrh67v",
          "oxyv9mp41l",
          "nh2z15u25v",
          "euq4ndba8k",
          "t96gbhx9ar",
          "9b0yiiybw3",
          "wh57u9zbv7",
          "t3c07f673g",
          "n67pltjxy2"
        ],
        "sampleHeader": "unique_id"
      },
      {
        "colType": "Text",
        "numRows": 94465,
        "numUniqueValues": 101,
        "sample": [
          "Los Angeles",
          "Union City",
          "Bakersfield",
          "Varna",
          "Santiago",
          "Ketchikan",
          "Nanaimo",
          "Ontario",
          "Little Rock",
          "Toronto"
        ],
        "sampleHeader": "departure_city"
      },
      {
        "colType": "Text",
        "numRows": 94465,
        "numUniqueValues": 101,
        "sample": [
          "Los Angeles",
          "Santiago",
          "Honolulu",
          "Puerto Vallarta",
          "Jackson",
          "Milwaukee",
          "Chicago",
          "Barcelona",
          "Dallas",
          "Toronto"
        ],
        "sampleHeader": "arrival_city"
      },
      {
        "colType": "Text",
        "numRows": 94465,
        "numUniqueValues": 101,
        "sample": [
          " Japan",
          " Lithuania",
          "departure_state",
          " Canada",
          " Egypt",
          " Lebanon",
          " Ecuador",
          " Kuwait",
          " Bangladesh",
          " Indonesia"
        ],
        "sampleHeader": "departure_state"
      },
      {
        "colType": "Text",
        "numRows": 94465,
        "numUniqueValues": 101,
        "sample": [
          "",
          " Japan",
          " Switzerland",
          " Canada",
          " Ecuador",
          " Norway",
          " Utah",
          " Alaska",
          " Ireland",
          " Texas"
        ],
        "sampleHeader": "arrival_state"
      }
    ],
    "numColumns": 27,
    "numRows": 94465
  },
  "status": "success"
}
